//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   𝗤𝗨𝗘𝗘𝗡-𝗗𝗜𝗡𝗨 𝗠𝗗 𝐁𝐎𝐓                                               //
//                                                                                                      //
//                                         Ｖ：1                                                       //
//
//
//░▒▓██████▓▒░░▒░▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░▓████████▓▒░▒▓███████▓▒░░   ░   ▒▓███████▓▒░░▒▓█▓▒░▒▓███████▓▒░   ▒▓█▓▒░░▒▓█▓▒░░▒▓██████████████▓▒▒█████████▓
//░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░░▒░░░▒▓█▓▒░░░▒░░░░▒▓█▓▒░░▒▓█▓▒░░░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓█  
//░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░░▒░░░▒▓█▓▒░░░▒░░░░▒▓█▓▒░░▒▓█▓▒░░░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓█                   
//░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓███████░░░▒▓██████▓░░░░▒▓█▓▒░░▒▓█▓▒░░░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓█
//░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░░▒░░░▒▓█▓▒░░░▒░░░░▒▓█▓▒░░▒▓█▓▒░░░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓█                  
//░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░░▒░░░▒▓█▓▒░░░▒░░░░▒▓█▓▒░░▒▓█▓▒░░░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░▒▓█                
//░▒▓███████▓░░░▒▓████████▓▒░▒▓████████▓▒░▓████████▓░░▒▓█▓▒░░▒▓█▓▒░░░░▒▓███████▓▒░░ ▒▓█▓   ░▒▓█▓▒░░▒▓█▓▒░░▒▓██████▓▒░░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒█████████▓  
//   ░▒▓█▓▒░                                                                                                                                                     
//    ░▒▓██▓▒░                                                                                                                                                   

//
//
//                                        
//
//
//
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : © 𝚀𝚄𝙴𝙴𝙽 𝙳𝙸𝙽𝚄 𝙼𝙳
//  * @version      : 4.0
//  * @author       : Dineth sathsara
//  * @youtube      : https://youtube.com/@dinethsathsara-rl5yp?si=WPJjhU1J-Ihw8p2D
//  * @description  : © 𝚀𝚄𝙴𝙴𝙽 𝙳𝙸𝙽𝚄 𝙼𝙳, A Multi-functional WhatsApp bot created by Dineth sathsara
//*
//*
//Base by dineth sathsara
//GitHub: @dinuboy
//WhatsApp: +94701040265
//Want more free bot scripts? Subscribe to my YouTube channel: https://youtube.com/@dinethsathsara-rl5yp?si=WPJjhU1J-Ihw8p2D
//   * Created By GitHub: Dinuboy
//   * Credit To Dineth sathsara
//   * © 2025 © 𝚀𝚄𝙴𝙴𝙽 𝙳𝙸𝙽𝚄 𝙼𝙳 ᵛ1
// ⛥┌┤
// */

const fs = require('fs');
if (fs.existsSync('config.env')) require('dotenv').config({ path: './config.env' });

function convertToBool(text, fault = 'true') {
    return text === fault ? true : false;
}
module.exports = {
SESSION_ID: process.env.SESSION_ID || "JOEL~XMD~hpMvcuLG",  //<----DON't REMOVE ["] THESE
SUDO: process.env.SUDO || ["94717775628","94758775628"],
PORT: process.env.PORT || "8000",
FOOTER: process.env.FOOTER || "> QUEEN DINU MD \n> Developed by Mr. DINETH\n> GitHub Repository: github.com/Dinuob/QUEEN_DINU_MD\n🌟 Premium Version | Advanced Features | Secure & Reliable 🌟\n© 2025 QUEEN DINU MD. All rights reserved.",
};
